/* automatically generated by rust-bindgen 0.69.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 38;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __KERNEL_OLD_TIMEVAL_MATCHES_TIMEVAL64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const ar_ResolvedWriteMode_ar_ResolvedWriteMode_Update: ar_ResolvedWriteMode = 0;
pub const ar_ResolvedWriteMode_ar_ResolvedWriteMode_Replace: ar_ResolvedWriteMode = 1;
#[doc = " enums"]
pub type ar_ResolvedWriteMode = ::std::os::raw::c_uint;
pub const gf_CameraProjection_gf_CameraProjection_Perspective: gf_CameraProjection = 0;
pub const gf_CameraProjection_gf_CameraProjection_Orthographic: gf_CameraProjection = 1;
pub type gf_CameraProjection = ::std::os::raw::c_uint;
pub const gf_CameraFOVDirection_gf_CameraFOVDirection_FOVHorizontal: gf_CameraFOVDirection = 0;
pub const gf_CameraFOVDirection_gf_CameraFOVDirection_FOVVertical: gf_CameraFOVDirection = 1;
pub type gf_CameraFOVDirection = ::std::os::raw::c_uint;
pub const gf_FrustumProjectionType_gf_FrustumProjectionType_Orthographic: gf_FrustumProjectionType =
    0;
pub const gf_FrustumProjectionType_gf_FrustumProjectionType_Perspective: gf_FrustumProjectionType =
    1;
pub type gf_FrustumProjectionType = ::std::os::raw::c_uint;
pub const ndr_VersionFilter_ndr_VersionFilter_NdrVersionFilterDefaultOnly: ndr_VersionFilter = 0;
pub const ndr_VersionFilter_ndr_VersionFilter_NdrVersionFilterAllVersions: ndr_VersionFilter = 1;
pub const ndr_VersionFilter_ndr_VersionFilter_NdrNumVersionFilters: ndr_VersionFilter = 2;
pub type ndr_VersionFilter = ::std::os::raw::c_uint;
pub const pcp_ArcType_pcp_ArcType_PcpArcTypeRoot: pcp_ArcType = 0;
pub const pcp_ArcType_pcp_ArcType_PcpArcTypeInherit: pcp_ArcType = 1;
pub const pcp_ArcType_pcp_ArcType_PcpArcTypeVariant: pcp_ArcType = 2;
pub const pcp_ArcType_pcp_ArcType_PcpArcTypeRelocate: pcp_ArcType = 3;
pub const pcp_ArcType_pcp_ArcType_PcpArcTypeReference: pcp_ArcType = 4;
pub const pcp_ArcType_pcp_ArcType_PcpArcTypePayload: pcp_ArcType = 5;
pub const pcp_ArcType_pcp_ArcType_PcpArcTypeSpecialize: pcp_ArcType = 6;
pub const pcp_ArcType_pcp_ArcType_PcpNumArcTypes: pcp_ArcType = 7;
pub type pcp_ArcType = ::std::os::raw::c_uint;
pub const pcp_TargetType_pcp_TargetType_TargetTypeConnection: pcp_TargetType = 1;
pub const pcp_TargetType_pcp_TargetType_TargetTypeRelationshipTarget: pcp_TargetType = 2;
pub type pcp_TargetType = ::std::os::raw::c_uint;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeNone: pcp_DependencyType = 0;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeRoot: pcp_DependencyType = 1;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypePurelyDirect: pcp_DependencyType =
    2;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypePartlyDirect: pcp_DependencyType =
    4;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeAncestral: pcp_DependencyType = 8;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeVirtual: pcp_DependencyType = 16;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeNonVirtual: pcp_DependencyType =
    32;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeDirect: pcp_DependencyType = 6;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeAnyNonVirtual: pcp_DependencyType =
    47;
pub const pcp_DependencyType_pcp_DependencyType_PcpDependencyTypeAnyIncludingVirtual:
    pcp_DependencyType = 63;
pub type pcp_DependencyType = ::std::os::raw::c_uint;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_ArcCycle: pcp_ErrorType = 0;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_ArcPermissionDenied: pcp_ErrorType = 1;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_IndexCapacityExceeded: pcp_ErrorType = 2;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_ArcCapacityExceeded: pcp_ErrorType = 3;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_ArcNamespaceDepthCapacityExceeded:
    pcp_ErrorType = 4;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InconsistentPropertyType: pcp_ErrorType = 5;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InconsistentAttributeType: pcp_ErrorType = 6;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InconsistentAttributeVariability: pcp_ErrorType =
    7;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InternalAssetPath: pcp_ErrorType = 8;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidPrimPath: pcp_ErrorType = 9;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidAssetPath: pcp_ErrorType = 10;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidInstanceTargetPath: pcp_ErrorType = 11;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidExternalTargetPath: pcp_ErrorType = 12;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidTargetPath: pcp_ErrorType = 13;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidReferenceOffset: pcp_ErrorType = 14;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidSublayerOffset: pcp_ErrorType = 15;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidSublayerOwnership: pcp_ErrorType = 16;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidSublayerPath: pcp_ErrorType = 17;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_InvalidVariantSelection: pcp_ErrorType = 18;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_MutedAssetPath: pcp_ErrorType = 19;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_OpinionAtRelocationSource: pcp_ErrorType = 20;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_PrimPermissionDenied: pcp_ErrorType = 21;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_PropertyPermissionDenied: pcp_ErrorType = 22;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_SublayerCycle: pcp_ErrorType = 23;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_TargetPermissionDenied: pcp_ErrorType = 24;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_UnresolvedPrimPath: pcp_ErrorType = 25;
pub const pcp_ErrorType_pcp_ErrorType_PcpErrorType_VariableExpressionError: pcp_ErrorType = 26;
pub type pcp_ErrorType = ::std::os::raw::c_uint;
pub const pcp_EditType_pcp_EditType_EditPath: pcp_EditType = 0;
pub const pcp_EditType_pcp_EditType_EditInherit: pcp_EditType = 1;
pub const pcp_EditType_pcp_EditType_EditSpecializes: pcp_EditType = 2;
pub const pcp_EditType_pcp_EditType_EditReference: pcp_EditType = 3;
pub const pcp_EditType_pcp_EditType_EditPayload: pcp_EditType = 4;
pub const pcp_EditType_pcp_EditType_EditRelocate: pcp_EditType = 5;
pub type pcp_EditType = ::std::os::raw::c_uint;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeRoot: pcp_PcpRangeType = 0;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeInherit: pcp_PcpRangeType = 1;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeVariant: pcp_PcpRangeType = 2;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeReference: pcp_PcpRangeType = 3;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypePayload: pcp_PcpRangeType = 4;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeSpecialize: pcp_PcpRangeType = 5;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeAll: pcp_PcpRangeType = 6;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeWeakerThanRoot: pcp_PcpRangeType = 7;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeStrongerThanPayload: pcp_PcpRangeType = 8;
pub const pcp_PcpRangeType_pcp_PcpRangeType_PcpRangeTypeInvalid: pcp_PcpRangeType = 9;
pub type pcp_PcpRangeType = ::std::os::raw::c_uint;
pub const sdf_SdfChangeListSubLayerChangeType_sdf_SdfChangeListSubLayerChangeType_SubLayerAdded:
    sdf_SdfChangeListSubLayerChangeType = 0;
pub const sdf_SdfChangeListSubLayerChangeType_sdf_SdfChangeListSubLayerChangeType_SubLayerRemoved : sdf_SdfChangeListSubLayerChangeType = 1 ;
pub const sdf_SdfChangeListSubLayerChangeType_sdf_SdfChangeListSubLayerChangeType_SubLayerOffset:
    sdf_SdfChangeListSubLayerChangeType = 2;
pub type sdf_SdfChangeListSubLayerChangeType = ::std::os::raw::c_uint;
pub const sdf_ListOpType_sdf_ListOpType_SdfListOpTypeExplicit: sdf_ListOpType = 0;
pub const sdf_ListOpType_sdf_ListOpType_SdfListOpTypeAdded: sdf_ListOpType = 1;
pub const sdf_ListOpType_sdf_ListOpType_SdfListOpTypeDeleted: sdf_ListOpType = 2;
pub const sdf_ListOpType_sdf_ListOpType_SdfListOpTypeOrdered: sdf_ListOpType = 3;
pub const sdf_ListOpType_sdf_ListOpType_SdfListOpTypePrepended: sdf_ListOpType = 4;
pub const sdf_ListOpType_sdf_ListOpType_SdfListOpTypeAppended: sdf_ListOpType = 5;
pub type sdf_ListOpType = ::std::os::raw::c_uint;
pub const sdf_NamespaceEditDetailResult_sdf_NamespaceEditDetailResult_Error:
    sdf_NamespaceEditDetailResult = 0;
pub const sdf_NamespaceEditDetailResult_sdf_NamespaceEditDetailResult_Unbatched:
    sdf_NamespaceEditDetailResult = 1;
pub const sdf_NamespaceEditDetailResult_sdf_NamespaceEditDetailResult_Okay:
    sdf_NamespaceEditDetailResult = 2;
pub type sdf_NamespaceEditDetailResult = ::std::os::raw::c_uint;
pub const sdf_Op_sdf_Op_Complement: sdf_Op = 0;
pub const sdf_Op_sdf_Op_ImpliedUnion: sdf_Op = 1;
pub const sdf_Op_sdf_Op_Union: sdf_Op = 2;
pub const sdf_Op_sdf_Op_Intersection: sdf_Op = 3;
pub const sdf_Op_sdf_Op_Difference: sdf_Op = 4;
pub const sdf_Op_sdf_Op_ExpressionRef: sdf_Op = 5;
pub const sdf_Op_sdf_Op_Pattern: sdf_Op = 6;
pub type sdf_Op = ::std::os::raw::c_uint;
pub const sdf_PredicateExpressionFnCallKind_sdf_PredicateExpressionFnCallKind_BareCall:
    sdf_PredicateExpressionFnCallKind = 0;
pub const sdf_PredicateExpressionFnCallKind_sdf_PredicateExpressionFnCallKind_ColonCall:
    sdf_PredicateExpressionFnCallKind = 1;
pub const sdf_PredicateExpressionFnCallKind_sdf_PredicateExpressionFnCallKind_ParenCall:
    sdf_PredicateExpressionFnCallKind = 2;
pub type sdf_PredicateExpressionFnCallKind = ::std::os::raw::c_uint;
pub const sdf_PredicateExpressionOp_sdf_PredicateExpressionOp_Call: sdf_PredicateExpressionOp = 0;
pub const sdf_PredicateExpressionOp_sdf_PredicateExpressionOp_Not: sdf_PredicateExpressionOp = 1;
pub const sdf_PredicateExpressionOp_sdf_PredicateExpressionOp_ImpliedAnd:
    sdf_PredicateExpressionOp = 2;
pub const sdf_PredicateExpressionOp_sdf_PredicateExpressionOp_And: sdf_PredicateExpressionOp = 3;
pub const sdf_PredicateExpressionOp_sdf_PredicateExpressionOp_Or: sdf_PredicateExpressionOp = 4;
pub type sdf_PredicateExpressionOp = ::std::os::raw::c_uint;
pub const sdf_Permission_sdf_Permission_SdfPermissionPublic: sdf_Permission = 0;
pub const sdf_Permission_sdf_Permission_SdfPermissionPrivate: sdf_Permission = 1;
pub const sdf_Permission_sdf_Permission_SdfNumPermissions: sdf_Permission = 2;
pub type sdf_Permission = ::std::os::raw::c_uint;
pub const sdf_Specifier_sdf_Specifier_SdfSpecifierDef: sdf_Specifier = 0;
pub const sdf_Specifier_sdf_Specifier_SdfSpecifierOver: sdf_Specifier = 1;
pub const sdf_Specifier_sdf_Specifier_SdfSpecifierClass: sdf_Specifier = 2;
pub const sdf_Specifier_sdf_Specifier_SdfNumSpecifiers: sdf_Specifier = 3;
pub type sdf_Specifier = ::std::os::raw::c_uint;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeUnknown: sdf_SpecType = 0;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeAttribute: sdf_SpecType = 1;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeConnection: sdf_SpecType = 2;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeExpression: sdf_SpecType = 3;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeMapper: sdf_SpecType = 4;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeMapperArg: sdf_SpecType = 5;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypePrim: sdf_SpecType = 6;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypePseudoRoot: sdf_SpecType = 7;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeRelationship: sdf_SpecType = 8;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeRelationshipTarget: sdf_SpecType = 9;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeVariant: sdf_SpecType = 10;
pub const sdf_SpecType_sdf_SpecType_SdfSpecTypeVariantSet: sdf_SpecType = 11;
pub const sdf_SpecType_sdf_SpecType_SdfNumSpecTypes: sdf_SpecType = 12;
pub type sdf_SpecType = ::std::os::raw::c_uint;
pub const sdf_Variability_sdf_Variability_SdfVariabilityVarying: sdf_Variability = 0;
pub const sdf_Variability_sdf_Variability_SdfVariabilityUniform: sdf_Variability = 1;
pub const sdf_Variability_sdf_Variability_SdfNumVariabilities: sdf_Variability = 2;
pub type sdf_Variability = ::std::os::raw::c_uint;
pub const usd_InterpolationType_usd_InterpolationType_UsdInterpolationTypeHeld:
    usd_InterpolationType = 0;
pub const usd_InterpolationType_usd_InterpolationType_UsdInterpolationTypeLinear:
    usd_InterpolationType = 1;
pub type usd_InterpolationType = ::std::os::raw::c_uint;
pub const usd_ListPosition_usd_ListPosition_UsdListPositionFrontOfPrependList: usd_ListPosition = 0;
pub const usd_ListPosition_usd_ListPosition_UsdListPositionBackOfPrependList: usd_ListPosition = 1;
pub const usd_ListPosition_usd_ListPosition_UsdListPositionFrontOfAppendList: usd_ListPosition = 2;
pub const usd_ListPosition_usd_ListPosition_UsdListPositionBackOfAppendList: usd_ListPosition = 3;
pub type usd_ListPosition = ::std::os::raw::c_uint;
pub const usd_LoadPolicy_usd_LoadPolicy_UsdLoadWithDescendants: usd_LoadPolicy = 0;
pub const usd_LoadPolicy_usd_LoadPolicy_UsdLoadWithoutDescendants: usd_LoadPolicy = 1;
pub type usd_LoadPolicy = ::std::os::raw::c_uint;
pub const usd_SchemaKind_usd_SchemaKind_Invalid: usd_SchemaKind = 0;
pub const usd_SchemaKind_usd_SchemaKind_AbstractBase: usd_SchemaKind = 1;
pub const usd_SchemaKind_usd_SchemaKind_AbstractTyped: usd_SchemaKind = 2;
pub const usd_SchemaKind_usd_SchemaKind_ConcreteTyped: usd_SchemaKind = 3;
pub const usd_SchemaKind_usd_SchemaKind_NonAppliedAPI: usd_SchemaKind = 4;
pub const usd_SchemaKind_usd_SchemaKind_SingleApplyAPI: usd_SchemaKind = 5;
pub const usd_SchemaKind_usd_SchemaKind_MultipleApplyAPI: usd_SchemaKind = 6;
pub type usd_SchemaKind = ::std::os::raw::c_uint;
pub const usd_ModelAPIKindValidation_usd_ModelAPIKindValidation_KindValidationNone:
    usd_ModelAPIKindValidation = 0;
pub const usd_ModelAPIKindValidation_usd_ModelAPIKindValidation_KindValidationModelHierarchy:
    usd_ModelAPIKindValidation = 1;
pub type usd_ModelAPIKindValidation = ::std::os::raw::c_uint;
pub const usd_UsdObjType_usd_UsdObjType_UsdTypeObject: usd_UsdObjType = 0;
pub const usd_UsdObjType_usd_UsdObjType_UsdTypePrim: usd_UsdObjType = 1;
pub const usd_UsdObjType_usd_UsdObjType_UsdTypeProperty: usd_UsdObjType = 2;
pub const usd_UsdObjType_usd_UsdObjType_UsdTypeAttribute: usd_UsdObjType = 3;
pub const usd_UsdObjType_usd_UsdObjType_UsdTypeRelationship: usd_UsdObjType = 4;
pub const usd_UsdObjType_usd_UsdObjType_Usd_NumObjTypes: usd_UsdObjType = 5;
pub type usd_UsdObjType = ::std::os::raw::c_uint;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_All:
    usd_PrimCompositionQueryArcTypeFilter = 0;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_Reference:
    usd_PrimCompositionQueryArcTypeFilter = 1;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_Payload:
    usd_PrimCompositionQueryArcTypeFilter = 2;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_Inherit:
    usd_PrimCompositionQueryArcTypeFilter = 3;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_Specialize:
    usd_PrimCompositionQueryArcTypeFilter = 4;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_Variant:
    usd_PrimCompositionQueryArcTypeFilter = 5;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_ReferenceOrPayload : usd_PrimCompositionQueryArcTypeFilter = 6 ;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_InheritOrSpecialize : usd_PrimCompositionQueryArcTypeFilter = 7 ;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_NotReferenceOrPayload : usd_PrimCompositionQueryArcTypeFilter = 8 ;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_NotInheritOrSpecialize : usd_PrimCompositionQueryArcTypeFilter = 9 ;
pub const usd_PrimCompositionQueryArcTypeFilter_usd_PrimCompositionQueryArcTypeFilter_NotVariant:
    usd_PrimCompositionQueryArcTypeFilter = 10;
pub type usd_PrimCompositionQueryArcTypeFilter = ::std::os::raw::c_uint;
pub const usd_PrimCompositionQueryArcIntroducedFilter_usd_PrimCompositionQueryArcIntroducedFilter_All : usd_PrimCompositionQueryArcIntroducedFilter = 0 ;
pub const usd_PrimCompositionQueryArcIntroducedFilter_usd_PrimCompositionQueryArcIntroducedFilter_IntroducedInRootLayerStack : usd_PrimCompositionQueryArcIntroducedFilter = 1 ;
pub const usd_PrimCompositionQueryArcIntroducedFilter_usd_PrimCompositionQueryArcIntroducedFilter_IntroducedInRootLayerPrimSpec : usd_PrimCompositionQueryArcIntroducedFilter = 2 ;
pub type usd_PrimCompositionQueryArcIntroducedFilter = ::std::os::raw::c_uint;
pub const usd_PrimCompositionQueryDependencyTypeFilter_usd_PrimCompositionQueryDependencyTypeFilter_All : usd_PrimCompositionQueryDependencyTypeFilter = 0 ;
pub const usd_PrimCompositionQueryDependencyTypeFilter_usd_PrimCompositionQueryDependencyTypeFilter_Direct : usd_PrimCompositionQueryDependencyTypeFilter = 1 ;
pub const usd_PrimCompositionQueryDependencyTypeFilter_usd_PrimCompositionQueryDependencyTypeFilter_Ancestral : usd_PrimCompositionQueryDependencyTypeFilter = 2 ;
pub type usd_PrimCompositionQueryDependencyTypeFilter = ::std::os::raw::c_uint;
pub const usd_PrimCompositionQueryHasSpecsFilter_usd_PrimCompositionQueryHasSpecsFilter_All:
    usd_PrimCompositionQueryHasSpecsFilter = 0;
pub const usd_PrimCompositionQueryHasSpecsFilter_usd_PrimCompositionQueryHasSpecsFilter_HasSpecs:
    usd_PrimCompositionQueryHasSpecsFilter = 1;
pub const usd_PrimCompositionQueryHasSpecsFilter_usd_PrimCompositionQueryHasSpecsFilter_HasNoSpecs : usd_PrimCompositionQueryHasSpecsFilter = 2 ;
pub type usd_PrimCompositionQueryHasSpecsFilter = ::std::os::raw::c_uint;
pub const usd_ResolveInfoSource_usd_ResolveInfoSource_UsdResolveInfoSourceNone:
    usd_ResolveInfoSource = 0;
pub const usd_ResolveInfoSource_usd_ResolveInfoSource_UsdResolveInfoSourceFallback:
    usd_ResolveInfoSource = 1;
pub const usd_ResolveInfoSource_usd_ResolveInfoSource_UsdResolveInfoSourceDefault:
    usd_ResolveInfoSource = 2;
pub const usd_ResolveInfoSource_usd_ResolveInfoSource_UsdResolveInfoSourceTimeSamples:
    usd_ResolveInfoSource = 3;
pub const usd_ResolveInfoSource_usd_ResolveInfoSource_UsdResolveInfoSourceValueClips:
    usd_ResolveInfoSource = 4;
pub type usd_ResolveInfoSource = ::std::os::raw::c_uint;
pub const usd_SchemaRegistryVersionPolicy_usd_SchemaRegistryVersionPolicy_All:
    usd_SchemaRegistryVersionPolicy = 0;
pub const usd_SchemaRegistryVersionPolicy_usd_SchemaRegistryVersionPolicy_GreaterThan:
    usd_SchemaRegistryVersionPolicy = 1;
pub const usd_SchemaRegistryVersionPolicy_usd_SchemaRegistryVersionPolicy_GreaterThanOrEqual:
    usd_SchemaRegistryVersionPolicy = 2;
pub const usd_SchemaRegistryVersionPolicy_usd_SchemaRegistryVersionPolicy_LessThan:
    usd_SchemaRegistryVersionPolicy = 3;
pub const usd_SchemaRegistryVersionPolicy_usd_SchemaRegistryVersionPolicy_LessThanOrEqual:
    usd_SchemaRegistryVersionPolicy = 4;
pub type usd_SchemaRegistryVersionPolicy = ::std::os::raw::c_uint;
pub const usd_StageInitialLoadSet_usd_StageInitialLoadSet_LoadAll: usd_StageInitialLoadSet = 0;
pub const usd_StageInitialLoadSet_usd_StageInitialLoadSet_LoadNone: usd_StageInitialLoadSet = 1;
pub type usd_StageInitialLoadSet = ::std::os::raw::c_uint;
pub const usd_StageLoadRulesRule_usd_StageLoadRulesRule_AllRule: usd_StageLoadRulesRule = 0;
pub const usd_StageLoadRulesRule_usd_StageLoadRulesRule_OnlyRule: usd_StageLoadRulesRule = 1;
pub const usd_StageLoadRulesRule_usd_StageLoadRulesRule_NoneRule: usd_StageLoadRulesRule = 2;
pub type usd_StageLoadRulesRule = ::std::os::raw::c_uint;
pub const usdGeom_ProtoXformInclusion_usdGeom_ProtoXformInclusion_IncludeProtoXform:
    usdGeom_ProtoXformInclusion = 0;
pub const usdGeom_ProtoXformInclusion_usdGeom_ProtoXformInclusion_ExcludeProtoXform:
    usdGeom_ProtoXformInclusion = 1;
pub type usdGeom_ProtoXformInclusion = ::std::os::raw::c_uint;
pub const usdGeom_MaskApplication_usdGeom_MaskApplication_ApplyMask: usdGeom_MaskApplication = 0;
pub const usdGeom_MaskApplication_usdGeom_MaskApplication_IgnoreMask: usdGeom_MaskApplication = 1;
pub type usdGeom_MaskApplication = ::std::os::raw::c_uint;
pub const usdGeom_XformCommonAPIRotationOrder_usdGeom_XformCommonAPIRotationOrder_RotationOrderXYZ : usdGeom_XformCommonAPIRotationOrder = 0 ;
pub const usdGeom_XformCommonAPIRotationOrder_usdGeom_XformCommonAPIRotationOrder_RotationOrderXZY : usdGeom_XformCommonAPIRotationOrder = 1 ;
pub const usdGeom_XformCommonAPIRotationOrder_usdGeom_XformCommonAPIRotationOrder_RotationOrderYXZ : usdGeom_XformCommonAPIRotationOrder = 2 ;
pub const usdGeom_XformCommonAPIRotationOrder_usdGeom_XformCommonAPIRotationOrder_RotationOrderYZX : usdGeom_XformCommonAPIRotationOrder = 3 ;
pub const usdGeom_XformCommonAPIRotationOrder_usdGeom_XformCommonAPIRotationOrder_RotationOrderZXY : usdGeom_XformCommonAPIRotationOrder = 4 ;
pub const usdGeom_XformCommonAPIRotationOrder_usdGeom_XformCommonAPIRotationOrder_RotationOrderZYX : usdGeom_XformCommonAPIRotationOrder = 5 ;
pub type usdGeom_XformCommonAPIRotationOrder = ::std::os::raw::c_uint;
pub const usdGeom_XformCommonAPIOpFlags_usdGeom_XformCommonAPIOpFlags_OpNone:
    usdGeom_XformCommonAPIOpFlags = 0;
pub const usdGeom_XformCommonAPIOpFlags_usdGeom_XformCommonAPIOpFlags_OpTranslate:
    usdGeom_XformCommonAPIOpFlags = 1;
pub const usdGeom_XformCommonAPIOpFlags_usdGeom_XformCommonAPIOpFlags_OpPivot:
    usdGeom_XformCommonAPIOpFlags = 2;
pub const usdGeom_XformCommonAPIOpFlags_usdGeom_XformCommonAPIOpFlags_OpRotate:
    usdGeom_XformCommonAPIOpFlags = 4;
pub const usdGeom_XformCommonAPIOpFlags_usdGeom_XformCommonAPIOpFlags_OpScale:
    usdGeom_XformCommonAPIOpFlags = 8;
pub type usdGeom_XformCommonAPIOpFlags = ::std::os::raw::c_uint;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeInvalid: usdGeom_XformOpType = 0;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeTranslate: usdGeom_XformOpType = 1;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeScale: usdGeom_XformOpType = 2;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateX: usdGeom_XformOpType = 3;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateY: usdGeom_XformOpType = 4;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateZ: usdGeom_XformOpType = 5;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateXYZ: usdGeom_XformOpType = 6;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateXZY: usdGeom_XformOpType = 7;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateYXZ: usdGeom_XformOpType = 8;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateYZX: usdGeom_XformOpType = 9;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateZXY: usdGeom_XformOpType = 10;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeRotateZYX: usdGeom_XformOpType = 11;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeOrient: usdGeom_XformOpType = 12;
pub const usdGeom_XformOpType_usdGeom_XformOpType_TypeTransform: usdGeom_XformOpType = 13;
pub type usdGeom_XformOpType = ::std::os::raw::c_uint;
pub const usdGeom_XformOpPrecision_usdGeom_XformOpPrecision_PrecisionDouble:
    usdGeom_XformOpPrecision = 0;
pub const usdGeom_XformOpPrecision_usdGeom_XformOpPrecision_PrecisionFloat:
    usdGeom_XformOpPrecision = 1;
pub const usdGeom_XformOpPrecision_usdGeom_XformOpPrecision_PrecisionHalf:
    usdGeom_XformOpPrecision = 2;
pub type usdGeom_XformOpPrecision = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_ArAsset_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_AssetSharedPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_ConstCharSharedPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_FileSizePair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_AssetInfo_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_ResolvedPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_Resolver_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_ResolverContext_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_ResolverContextVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_Timestamp_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_WritableAsset_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_WritableAssetSharedPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2f_t {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_gf_Vec2f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec2f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec2f_t>(),
        8usize,
        concat!("Size of: ", stringify!(gf_Vec2f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec2f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Vec2f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2f_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2f_t),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2fArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3f_t {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_gf_Vec3f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec3f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec3f_t>(),
        12usize,
        concat!("Size of: ", stringify!(gf_Vec3f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec3f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Vec3f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3f_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3f_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3f_t),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3fArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3fArrayVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4f_t {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_gf_Vec4f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec4f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec4f_t>(),
        16usize,
        concat!("Size of: ", stringify!(gf_Vec4f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec4f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Vec4f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4f_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4f_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4f_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4f_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4fArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4fVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2h_t {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_gf_Vec2h_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec2h_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec2h_t>(),
        4usize,
        concat!("Size of: ", stringify!(gf_Vec2h_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec2h_t>(),
        2usize,
        concat!("Alignment of ", stringify!(gf_Vec2h_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2h_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2h_t),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2hArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3h_t {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
    pub z: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_gf_Vec3h_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec3h_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec3h_t>(),
        6usize,
        concat!("Size of: ", stringify!(gf_Vec3h_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec3h_t>(),
        2usize,
        concat!("Alignment of ", stringify!(gf_Vec3h_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3h_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3h_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3h_t),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3hArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4h_t {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
    pub z: ::std::os::raw::c_short,
    pub w: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_gf_Vec4h_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec4h_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec4h_t>(),
        8usize,
        concat!("Size of: ", stringify!(gf_Vec4h_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec4h_t>(),
        2usize,
        concat!("Alignment of ", stringify!(gf_Vec4h_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4h_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4h_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4h_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4h_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4hArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2d_t {
    pub x: f64,
    pub y: f64,
}
#[test]
fn bindgen_test_layout_gf_Vec2d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec2d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec2d_t>(),
        16usize,
        concat!("Size of: ", stringify!(gf_Vec2d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec2d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Vec2d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2d_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2d_t),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2dArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3d_t {
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[test]
fn bindgen_test_layout_gf_Vec3d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec3d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec3d_t>(),
        24usize,
        concat!("Size of: ", stringify!(gf_Vec3d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec3d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Vec3d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3d_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3d_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3d_t),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3dVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3dArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4d_t {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub w: f64,
}
#[test]
fn bindgen_test_layout_gf_Vec4d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec4d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec4d_t>(),
        32usize,
        concat!("Size of: ", stringify!(gf_Vec4d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec4d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Vec4d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4d_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4d_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4d_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4d_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4dArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2i_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gf_Vec2i_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec2i_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec2i_t>(),
        8usize,
        concat!("Size of: ", stringify!(gf_Vec2i_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec2i_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Vec2i_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2i_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec2i_t),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec2iArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3i_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub z: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gf_Vec3i_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec3i_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec3i_t>(),
        12usize,
        concat!("Size of: ", stringify!(gf_Vec3i_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec3i_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Vec3i_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3i_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3i_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec3i_t),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec3iArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4i_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub z: ::std::os::raw::c_int,
    pub w: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gf_Vec4i_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Vec4i_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Vec4i_t>(),
        16usize,
        concat!("Size of: ", stringify!(gf_Vec4i_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Vec4i_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Vec4i_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4i_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4i_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4i_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Vec4i_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Vec4iArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix2d_t {
    pub m: [f64; 4usize],
}
#[test]
fn bindgen_test_layout_gf_Matrix2d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Matrix2d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Matrix2d_t>(),
        32usize,
        concat!("Size of: ", stringify!(gf_Matrix2d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Matrix2d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Matrix2d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Matrix2d_t),
            "::",
            stringify!(m)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix2dArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix3d_t {
    pub m: [f64; 9usize],
}
#[test]
fn bindgen_test_layout_gf_Matrix3d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Matrix3d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Matrix3d_t>(),
        72usize,
        concat!("Size of: ", stringify!(gf_Matrix3d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Matrix3d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Matrix3d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Matrix3d_t),
            "::",
            stringify!(m)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix3dArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix4d_t {
    pub m: [f64; 16usize],
}
#[test]
fn bindgen_test_layout_gf_Matrix4d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Matrix4d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Matrix4d_t>(),
        128usize,
        concat!("Size of: ", stringify!(gf_Matrix4d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Matrix4d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Matrix4d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Matrix4d_t),
            "::",
            stringify!(m)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix4dArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix4dArrayVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix2f_t {
    pub m: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_gf_Matrix2f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Matrix2f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Matrix2f_t>(),
        16usize,
        concat!("Size of: ", stringify!(gf_Matrix2f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Matrix2f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Matrix2f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Matrix2f_t),
            "::",
            stringify!(m)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix2fArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix3f_t {
    pub m: [f32; 9usize],
}
#[test]
fn bindgen_test_layout_gf_Matrix3f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Matrix3f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Matrix3f_t>(),
        36usize,
        concat!("Size of: ", stringify!(gf_Matrix3f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Matrix3f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Matrix3f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Matrix3f_t),
            "::",
            stringify!(m)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix3fArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix4f_t {
    pub m: [f32; 16usize],
}
#[test]
fn bindgen_test_layout_gf_Matrix4f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Matrix4f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Matrix4f_t>(),
        64usize,
        concat!("Size of: ", stringify!(gf_Matrix4f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Matrix4f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Matrix4f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Matrix4f_t),
            "::",
            stringify!(m)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Matrix4fArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Quatd_t {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub w: f64,
}
#[test]
fn bindgen_test_layout_gf_Quatd_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Quatd_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Quatd_t>(),
        32usize,
        concat!("Size of: ", stringify!(gf_Quatd_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Quatd_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Quatd_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatd_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatd_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatd_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatd_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_QuatdArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Quatf_t {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_gf_Quatf_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Quatf_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Quatf_t>(),
        16usize,
        concat!("Size of: ", stringify!(gf_Quatf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Quatf_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Quatf_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatf_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatf_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatf_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quatf_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_QuatfArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Quath_t {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
    pub z: ::std::os::raw::c_short,
    pub w: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_gf_Quath_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Quath_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Quath_t>(),
        8usize,
        concat!("Size of: ", stringify!(gf_Quath_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Quath_t>(),
        2usize,
        concat!("Alignment of ", stringify!(gf_Quath_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quath_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quath_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quath_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Quath_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_QuathArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Interval_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_BBox3d_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Range1d_t {
    pub mn: f64,
    pub mx: f64,
}
#[test]
fn bindgen_test_layout_gf_Range1d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Range1d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Range1d_t>(),
        16usize,
        concat!("Size of: ", stringify!(gf_Range1d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Range1d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Range1d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range1d_t),
            "::",
            stringify!(mn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range1d_t),
            "::",
            stringify!(mx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Range1f_t {
    pub mn: f32,
    pub mx: f32,
}
#[test]
fn bindgen_test_layout_gf_Range1f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Range1f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Range1f_t>(),
        8usize,
        concat!("Size of: ", stringify!(gf_Range1f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Range1f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Range1f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range1f_t),
            "::",
            stringify!(mn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mx) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range1f_t),
            "::",
            stringify!(mx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Range2d_t {
    pub mn: gf_Vec2d_t,
    pub mx: gf_Vec2d_t,
}
#[test]
fn bindgen_test_layout_gf_Range2d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Range2d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Range2d_t>(),
        32usize,
        concat!("Size of: ", stringify!(gf_Range2d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Range2d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Range2d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range2d_t),
            "::",
            stringify!(mn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range2d_t),
            "::",
            stringify!(mx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Range2f_t {
    pub mn: gf_Vec2f_t,
    pub mx: gf_Vec2f_t,
}
#[test]
fn bindgen_test_layout_gf_Range2f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Range2f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Range2f_t>(),
        16usize,
        concat!("Size of: ", stringify!(gf_Range2f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Range2f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Range2f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range2f_t),
            "::",
            stringify!(mn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range2f_t),
            "::",
            stringify!(mx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Range3d_t {
    pub mn: gf_Vec3d_t,
    pub mx: gf_Vec3d_t,
}
#[test]
fn bindgen_test_layout_gf_Range3d_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Range3d_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Range3d_t>(),
        48usize,
        concat!("Size of: ", stringify!(gf_Range3d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Range3d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Range3d_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range3d_t),
            "::",
            stringify!(mn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mx) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range3d_t),
            "::",
            stringify!(mx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Range3f_t {
    pub mn: gf_Vec3f_t,
    pub mx: gf_Vec3f_t,
}
#[test]
fn bindgen_test_layout_gf_Range3f_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Range3f_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Range3f_t>(),
        24usize,
        concat!("Size of: ", stringify!(gf_Range3f_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Range3f_t>(),
        4usize,
        concat!("Alignment of ", stringify!(gf_Range3f_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range3f_t),
            "::",
            stringify!(mn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mx) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Range3f_t),
            "::",
            stringify!(mx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Camera_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Frustum_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Ray_t {
    pub startPoint: gf_Vec3d_t,
    pub direction: gf_Vec3d_t,
}
#[test]
fn bindgen_test_layout_gf_Ray_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Ray_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Ray_t>(),
        48usize,
        concat!("Size of: ", stringify!(gf_Ray_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Ray_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Ray_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startPoint) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Ray_t),
            "::",
            stringify!(startPoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Ray_t),
            "::",
            stringify!(direction)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gf_Rotation_t {
    pub axis: gf_Vec3d_t,
    pub angle: f64,
}
#[test]
fn bindgen_test_layout_gf_Rotation_t() {
    const UNINIT: ::std::mem::MaybeUninit<gf_Rotation_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gf_Rotation_t>(),
        32usize,
        concat!("Size of: ", stringify!(gf_Rotation_t))
    );
    assert_eq!(
        ::std::mem::align_of::<gf_Rotation_t>(),
        8usize,
        concat!("Alignment of ", stringify!(gf_Rotation_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Rotation_t),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angle) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gf_Rotation_t),
            "::",
            stringify!(angle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct js_Array_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct js_Object_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct js_Value_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct js_TokenValuePair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_NdrVersion_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_DiscoveryPluginContext_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_DiscoveryPlugin_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_DiscoveryPluginRefPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_DiscoveryUri_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_Node_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_NodeUniquePtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_NodeConstPtrVec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_NodeDiscoveryResult_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_NodeDiscoveryResultVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_ParserPlugin_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_Property_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_PropertyUniquePtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_PropertyUniquePtrVec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_SdfTypeIndicator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_Registry_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_NdrRegistryDiscoveryPluginRefPtrVec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_TokenMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndr_OptionVec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_Arc_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_Cache_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_InvalidAssetPathMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_CachePayloadSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_Changes_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PcpChangesCacheChanges_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_SourceArcInfo_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_SourceArcInfoVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_Dependency_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_DependencyVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_CulledDependency_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_DynamicFileFormatContext_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_DynamicFileFormatDependencyData_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_DynamicFileFormatInterface_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorBaseSharedPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorBaseSharedPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorArcCycle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorArcPermissionDenied_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorCapacityExceeded_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInconsistentPropertyBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInconsistentPropertyType_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInconsistentAttributeType_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInconsistentAttributeVariability_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidPrimPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidAssetPathBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidAssetPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorMutedAssetPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorTargetPathBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidInstaceTargetPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidExternalTargetPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidTargetPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidSublayerOffset_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidReferenceOffset_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidSublayerOwnership_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorInvalidSublayerPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorOpinionAtRelocationSource_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorPrimPermissionDenied_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorPropertyPermissionDenied_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorSublayerCycle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorTargetPermissionDenied_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorUnresolvedPrimPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ErrorVariableExpressionError_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ExpressionVariables_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ExpressionVariableCachingComposer_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ExpressionVariablesDependencyData_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_ExpressionVariablesSource_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_InstanceKey_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_NodeIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_NodeReverseIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PrimIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PrimReverseIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PropertyIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PropertyReverseIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_LayerStack_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_LayerStackPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_LayerStackPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_LayerStackRefPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_LayerStackIdentifier_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_MapExpression_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_MapExpressionVariable_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_MapFunction_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_MapFunctionPathMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_NamespaceEdits_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_NamespaceEditsCacheSite_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_NamespaceEditsLayerStackSite_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_NodeRef_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PrimIndex_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PrimIndexOutputs_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PrimIndexInputs_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_PropertyIndex_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_Site_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_TargetIndex_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_VariantFallbackMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcp_SiteTrackerSegment_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractData_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataConstPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataConstPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataRefPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataRefPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataConstRefPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataConstRefPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataValue_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AbstractDataConstValue_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_Allowed_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AssetPath_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AssetPathArray_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AttributeSpec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AttributeSpecHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AttributeSpecHandleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_AttributeSpecView_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ChangeBlock_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ChangeList_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfChangeListEntry_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ChangeListEntryList_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PathChangeListEntryPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerChangeListVec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfCopySpecsValueEdit_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfData_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfFileFormat_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_FileFormatConstPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_FileFormatFileFormatArguments_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_Layer_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerRefPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerHandleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerHandleSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerHints_t {
    pub mightHaveRelocates: bool,
}
#[test]
fn bindgen_test_layout_sdf_LayerHints_t() {
    const UNINIT: ::std::mem::MaybeUninit<sdf_LayerHints_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sdf_LayerHints_t>(),
        1usize,
        concat!("Size of: ", stringify!(sdf_LayerHints_t))
    );
    assert_eq!(
        ::std::mem::align_of::<sdf_LayerHints_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdf_LayerHints_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mightHaveRelocates) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdf_LayerHints_t),
            "::",
            stringify!(mightHaveRelocates)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerOffset_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerOffsetVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerStateDelegate_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerTree_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerTreeHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_LayerTreeHandleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_StringListOp_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NamespaceEdit_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NamespaceEditVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NamespaceEditDetail_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NamespaceEditDetailVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_BatchNamespaceEdit_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_Notice_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeBaseLayersDidChange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeBaseLayersDidChangeConstIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayersDidChangeSentPerLayer_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayersDidChange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayerInfoDidChange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayerIdentifierDidChange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayerDidReplaceContent_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayerDidReloadContent_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeDidSaveLayerToFile_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayerDirtinessChanged_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NoticeLayerMutenessChanged_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_Path_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PathSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PathVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfPathExpression_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PathPattern_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_Component_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ExpressionReference_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_Payload_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PayloadVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PredicateExpression_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PredicateExpressionFnArg_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PredicateExpressionFnCall_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PrimSpec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PrimSpecHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PrimSpecHandleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PrimSpecHandleOffsetPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PrimSpecHandleOffsetPairVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PrimSpecView_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PropertySpec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PropertySpecHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PropertySpecHandleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PropertySpecHandleOffsetPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PropertySpecHandleOffsetPairVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PropertySpecView_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_DictionaryProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NameOrderProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SubLayerProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_NameEditorProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PathEditorProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_PayloadEditorProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ReferenceEditorProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantSelectionProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelocatesMapProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantSetsProxy_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_Reference_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ReferenceVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelationshipSpec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelationshipSpecHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelationshipSpecHandleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelationshipSpecView_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelationshipSpecHandleOffsetPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelationshipSpecHandleOffsetPairVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfSchemaBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_FieldDefinition_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SpecDefinition_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfSchema_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SchemaBaseFieldDefinitionInfoVec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SdfSpec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_SpecHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_TimeCode_t {
    pub time: f64,
}
#[test]
fn bindgen_test_layout_sdf_TimeCode_t() {
    const UNINIT: ::std::mem::MaybeUninit<sdf_TimeCode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sdf_TimeCode_t>(),
        8usize,
        concat!("Size of: ", stringify!(sdf_TimeCode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<sdf_TimeCode_t>(),
        8usize,
        concat!("Alignment of ", stringify!(sdf_TimeCode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdf_TimeCode_t),
            "::",
            stringify!(time)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_RelocatesMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_TimeSampleMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ValueBlock_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ValueTypeName_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_ValueTypeNameVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_TupleDimensions_t {
    pub d: [usize; 2usize],
    pub size: usize,
}
#[test]
fn bindgen_test_layout_sdf_TupleDimensions_t() {
    const UNINIT: ::std::mem::MaybeUninit<sdf_TupleDimensions_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sdf_TupleDimensions_t>(),
        24usize,
        concat!("Size of: ", stringify!(sdf_TupleDimensions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<sdf_TupleDimensions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(sdf_TupleDimensions_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdf_TupleDimensions_t),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sdf_TupleDimensions_t),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariableExpression_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariableExpressionResult_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantSetSpec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantSetSpecHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantSpec_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantSpecHandle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantSpecHandleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdf_VariantView_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdr_Registry_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdr_ShaderNode_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdr_ShaderNodeVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdr_ShaderProperty_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_String_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_StringVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_StringPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_StringPairVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_StringSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_StringUnorderedSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_DoubleVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_DoubleSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_Enum_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_Token_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_Type_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_TypeSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_TypeVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_TokenVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_TokenSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tf_TokenTokenPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_AttributeQuery_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_AttributeQueryVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ClipsAPI_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CollectionAPI_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CollectionAPIVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CollectionMembershipQuery_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CollectionMembershipQueryHash_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CollectionMembershipQueryPathExpansionRuleMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_MetadataValueMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CrateInfo_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CrateInfoSection_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CratreInfoSectionVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_CrateInfoSummaryStats_t {
    pub numSpecs: usize,
    pub numUniquePaths: usize,
    pub numUniqueTokens: usize,
    pub numUniqueStrings: usize,
    pub numUniqueFields: usize,
    pub numUniqueFieldSets: usize,
}
#[test]
fn bindgen_test_layout_usd_CrateInfoSummaryStats_t() {
    const UNINIT: ::std::mem::MaybeUninit<usd_CrateInfoSummaryStats_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usd_CrateInfoSummaryStats_t>(),
        48usize,
        concat!("Size of: ", stringify!(usd_CrateInfoSummaryStats_t))
    );
    assert_eq!(
        ::std::mem::align_of::<usd_CrateInfoSummaryStats_t>(),
        8usize,
        concat!("Alignment of ", stringify!(usd_CrateInfoSummaryStats_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numSpecs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_CrateInfoSummaryStats_t),
            "::",
            stringify!(numSpecs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numUniquePaths) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_CrateInfoSummaryStats_t),
            "::",
            stringify!(numUniquePaths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numUniqueTokens) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_CrateInfoSummaryStats_t),
            "::",
            stringify!(numUniqueTokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numUniqueStrings) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_CrateInfoSummaryStats_t),
            "::",
            stringify!(numUniqueStrings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numUniqueFields) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_CrateInfoSummaryStats_t),
            "::",
            stringify!(numUniqueFields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numUniqueFieldSets) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_CrateInfoSummaryStats_t),
            "::",
            stringify!(numUniqueFieldSets)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_EditTarget_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Inherits_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ModelAPI_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Notice_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageNotice_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageContentsChanged_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ObjectsChanged_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ObjectsChangedPathRange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ObjectsChangedPathRangeIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageEditTargetChanged_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_LayerMutingChanged_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Attribute_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_AttributeVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Object_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ObjectSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Prim_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimTypeInfo_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimFlagsPredicate_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Property_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PropertyVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Relationship_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_RelationshipVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Payloads_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimCompositionQuery_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimCompositionQueryArc_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimCompositionQueryArcVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimCompositionQueryFilter_t {
    pub arcTypeFilter: ::std::os::raw::c_int,
    pub dependencyTypeFilter: ::std::os::raw::c_int,
    pub arcIntroducedFilter: ::std::os::raw::c_int,
    pub hasSpecsFilter: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_usd_PrimCompositionQueryFilter_t() {
    const UNINIT: ::std::mem::MaybeUninit<usd_PrimCompositionQueryFilter_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usd_PrimCompositionQueryFilter_t>(),
        16usize,
        concat!("Size of: ", stringify!(usd_PrimCompositionQueryFilter_t))
    );
    assert_eq!(
        ::std::mem::align_of::<usd_PrimCompositionQueryFilter_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(usd_PrimCompositionQueryFilter_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arcTypeFilter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_PrimCompositionQueryFilter_t),
            "::",
            stringify!(arcTypeFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dependencyTypeFilter) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_PrimCompositionQueryFilter_t),
            "::",
            stringify!(dependencyTypeFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arcIntroducedFilter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_PrimCompositionQueryFilter_t),
            "::",
            stringify!(arcIntroducedFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasSpecsFilter) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_PrimCompositionQueryFilter_t),
            "::",
            stringify!(hasSpecsFilter)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimDefinition_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimDefinitionProperty_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimDefinitionAttribute_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimDefinitionRelationship_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimRange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimRangeIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimSiblingRange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimSiblingIterator_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimSubtreeRange_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_References_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ResolveInfo_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_ResolveTarget_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_APISchemaBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_SchemaBase_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_SchemaRegistry_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_SchemaRegistrySchemaInfo_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_SchemaRegistrySchemaInfoConstPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_TokenSchemaVersionPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_SchemaRegistryTokenToTokenVectorMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PrimDefinitionPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Specializes_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_Stage_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageRefPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageRefPtrVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageWeakPtr_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageCache_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageCacheId_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_UsdStageCacheRequest_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageLoadRules_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PathStageLoadRulesRulePair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_PathStageLoadRulesRulePairVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_UsdStagePopulationMask_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_TimeCode_t {
    pub time: f64,
}
#[test]
fn bindgen_test_layout_usd_TimeCode_t() {
    const UNINIT: ::std::mem::MaybeUninit<usd_TimeCode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usd_TimeCode_t>(),
        8usize,
        concat!("Size of: ", stringify!(usd_TimeCode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<usd_TimeCode_t>(),
        8usize,
        concat!("Alignment of ", stringify!(usd_TimeCode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usd_TimeCode_t),
            "::",
            stringify!(time)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_TimeCodeVector_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_UsdVariantSet_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_UsdVariantSets_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usd_StageEditTargetPair_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usdGeom_BasisCurves_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usdGeom_BBoxCache_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usdGeom_PathMatrixHashMap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usdGeom_Boundable_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usdGeom_Camera_t {
